import React from 'react'

const MoviesTextInfoHeader = () => {
    return (
        <div className="headerBar__textInfo">
            <div className="headerBar__titleSection">
                <div className="headerBar__titleWrapper">
                    <h1 className="headerBar__title">Фильмы смотреть онлайн</h1>
                </div>
                <div className="clause clause_is-native catalog__clause">
                    <div className="clause__text is-truncated">
                        <div className="clause__text-inner hidden-children">
                            <p>Вы любите смотреть фильмы
                                онлайн
                                и проводите много времени, прочесывая сайты в поисках чего-нибудь
                                интересного?
                                Стоит задержаться на ivi.ru – фильмов, которые собраны у нас, вам хватит
                                надолго. Коллекция постоянно пополняется как новыми фильмами, так и
                                признанными
                                шедеврами прошлых лет! Независимо от того, кто вы – любитель энергичных <a
                                    href="https://www.ivi.ru/movies/boeviki">боевиков</a> или поклонница
                                молодежных сериалов, изобилие нашего каталога заставит вас забыть обо всех
                                других способах проведения досуга, и вы будете пересматривать любимые фильмы
                                онлайн снова и снова!</p>
                            <p>Выбор фильмов очень широк и многообразен, так что каждый найдет для себя
                                что-то интересное, каким бы ни были его вкусы. Предпочитаете картины
                                исключительно <a
                                    href="https://www.ivi.ru/movies/foreign">зарубежного</a>
                                производства? У нас их предостаточно: это и золотая классика Голливуда,
                                и
                                душевные французские комедии, и темпераментные итальянские драмы, и
                                шумные
                                индийские музыкальные фильмы. А может, вы патриот и любите <a
                                    href="https://www.ivi.ru/movies/ru"
                                    title="Российские фильмы онлайн">российские фильмы</a>? Что ж, и
                                таких фильмов у нас немало. Что вам больше по вкусу – добрая старая
                                классика
                                или <a href="https://www.ivi.ru/new"
                                       title="Фильмы новинки кинопроката онлайн">новинки кинопроката</a>?
                                Неважно, каким
                                будет ваш ответ – у нас есть все, как картины эпохи зарождения
                                кинематографа, так <a href="https://www.ivi.ru/movies/2018"
                                                      title="Смотреть фильмы 2018 года онлайн">2018
                                    года</a> и
                                <a href="https://www.ivi.ru/movies/2017" title="Фильмы 2017 года">фильмы
                                    2017</a>.</p>
                            <p>В нашем каталоге вы найдете любые жанры. Это и <a
                                href="https://www.ivi.ru/collections/movies-about-love"
                                title="Фильмы про любовь - онлайн">фильмы про
                                любовь</a>, и детективы, и боевики, и вестерны, и фантастика, и
                                арт-хаус, и
                                уморительные комедии, и <a
                                    href="https://www.ivi.ru/collections/movies-war-1941-1945"
                                    title="Лучшие фильмы про войну 1941-1945 онлайн">фильмы
                                    про войну</a>, и ужасы, и триллеры, и документалистика... Кроме
                                «полного
                                метра» на сайте представлены также короткометражные фильмы, а также
                                иностранные и <a href="https://www.ivi.ru/series/ru"
                                                 title="Русские сериалы онлайн">русские сериалы</a>.
                            </p>
                            <p>Если вас интересуют самые знаковые фильмы онлайн в том или ином жанре,
                                система рубрикации поможет вам без труда сориентироваться и найти,
                                например,
                                лучшие <a href="https://www.ivi.ru/movies/drama"
                                          title="Лучшие драмы смотреть онлайн">драмы</a> или лучший
                                анимационный фильм онлайн.</p>
                            <p>Не упустите замечательную возможность смотреть фильмы онлайн без
                                регистрации,
                                выбирая только то, что вам действительно интересно, и тогда, когда вам
                                это
                                удобно. Ведь это так просто и приятно!</p>
                        </div>
                        <span className="clause__toggle">Развернуть</span></div>
                </div>
            </div>
        </div>
    )
}

export default MoviesTextInfoHeader